// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

//456 -> 5
//782 -> 8
//918 -> 1
void twodig(int dig)
{
    if (dig > 0)
    {
    int des = dig % 100;
    int des2 = des / 10;
    Console.WriteLine("huy");
    }
}



    


int dig = 456;


